package cn.wlk.keepcoding.niuke.Y2017.BaiDu;

import org.junit.Test;

/**
 * 2020/3/28 17:14
 * author:WLK
 *
 * 百度2017春招笔试真题编程题集合
 * 00:10:49
 * 2/5
 * [编程题]度度熊回家
 *
 * 时间限制：C/C++ 1秒，其他语言2秒
 *
 * 空间限制：C/C++ 32M，其他语言64M
 * 一个数轴上共有N个点，第一个点的坐标是度度熊现在位置，第N-1个点是度度熊的家。现在他需要依次的从0号坐标走到N-1号坐标。
 * 但是除了0号坐标和N-1号坐标，他可以在其余的N-2个坐标中选出一个点，并直接将这个点忽略掉，问度度熊回家至少走多少距离？
 *
 * 输入描述:
 *
 * 输入一个正整数N, N <= 50。
 *
 * 接下来N个整数表示坐标，正数表示X轴的正方向，负数表示X轴的负方向。绝对值小于等于100
 *
 *
 * 输出描述:
 *
 * 输出一个整数表示度度熊最少需要走的距离。
 *
 *
 * 输入例子1:
 *
 * 4
 * 1 4 -1 3
 *
 *
 * 输出例子1:
 *
 * 4
 *
 */

public class B2 {

    @Test
    public void test() {
        B2 t = new B2();
    }

    /**
     * 垃圾题，，垃圾题意
     */
    public void func(){

    }

}
